<?php
namespace Error;
/**
 * 错误码设置类
 */
class CodeConfigModel {
    /**
     * 获取错误码配置
     */
    public static function getCodeConfig() {
        return array(
            "200"=>"success",
            "1000"=>"请求方式错误",
            "1001"=>"缺少商圈ID",
            "1002"=>"缺少用户ID",
            "1003"=>"缺少店铺ID",
            "1004"=>"缺少搜索条件",
            "1005"=>"缺少商品分类",
            "1006"=>"缺少商品ID",
            "1007"=>"用户不存在",
            "1008"=>"缺少内容",
            "1009"=>"数据重复,请更换",
            "1010"=>"缺少标题",
            "1011"=>"缺少专区ID",
            "1012"=>"缺少图片",
            "1013"=>"缺少商家名称",
            "1014"=>"缺少商家LOGO",
            "1015"=>"缺少商家简介",
            "1016"=>"缺少商家描述",
            "1017"=>"缺少商家楼层",
            "1018"=>"缺少商家地址",
            "1019"=>"缺少商家房间号",
            "1020"=>"缺少经营类目",
            "1021"=>"缺少自定义标签",
            "1022"=>"缺少商家电话",
            "1023"=>"缺少微信二维码",
            "1024"=>"缺少商品名称",
            "1025"=>"缺少商品描述",
            "1026"=>"缺少商品图片",
            "1027"=>"缺少商品自定义标签",
            "1028"=>"缺少商品专区",
            "1029"=>"缺少商品列表状态",
            "401"=>"用户未登陆",
            "500"=>"系统繁忙，请稍候再试"
        );
    }

}
